target/classes/HelloService.wsdl

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:bpws="http://docs.oasis-open.org/wsbpel/2.0/process/executable" xmlns:tns="http://ode/bpel/unit-test.wsdl" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" targetNamespace="http://ode/bpel/unit-test.wsdl">
  <message name="HelloMessage">
    <part name="TestPart" type="xsd:string">
    </part>
  </message>
  <portType name="HelloPortType">
    <operation name="hello">
      <input name="TestIn" message="tns:HelloMessage">
    </input>
      <output name="TestOut" message="tns:HelloMessage">
    </output>
    </operation>
  </portType>
  <binding name="HelloSoapBinding" type="tns:HelloPortType">
    <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="hello">
      <soap:operation soapAction="" style="rpc"/>
      <input>
        <soap:body use="literal" namespace="http://ode/bpel/unit-test.wsdl"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://ode/bpel/unit-test.wsdl"/>
      </output>
    </operation>
  </binding>
  <service name="HelloService">
    <port name="HelloPort" binding="tns:HelloSoapBinding">
      <soap:address location="http://10.100.4.192:9763/services/HelloService/"/>
    </port>
  </service>
    <plnk:partnerLinkType name="HelloPartnerLinkType">
       <plnk:role name="me" portType="tns:HelloPortType"/>
       <plnk:role name="you" portType="tns:HelloPortType"/>
   </plnk:partnerLinkType>
</definitions>